salara1960/stm32f401_project/Core/Src/main.c
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

    while (!restart_flag) {

#ifdef SET_IRED
  		if (!tmr_ired) {
			if (decodeIRED(&results)) {

				tmr_ired = get_tmr10(_300ms);
				//HAL_GPIO_TogglePin(ENC_LED_GPIO_Port, ENC_LED_Pin);
				int8_t kid = -1;
				for (int8_t i = 0; i < MAX_IRED_KEY; i++) {
					if (results.value == keyAll[i].code) {
						kid = i;
						break;
					}
				}
				//
				if (kid == -1) sprintf(stline, "CODE:%08lX", results.value);
						  else sprintf(stline, "irKEY: %s", keyAll[kid].name);
				mkLineCenter(stline, FONT_WIDTH);
				i2c_ssd1306_text_xy(stline, 1, 3, false);
				//
				//uint8_t ys = 0;
				evt_t eve = msg_none;
				if (kid != -1) {
					switch (kid) {
						case key_ch:
							restart_flag = 1;
						break;
						case key_ch_plus:
							eve = msg_ukDirSel;//msg_eqGet;
						break;
						case key_ch_minus:
							eve = msg_newDir;//msg_volGet;
						break;
						case key_minus:
							eve = msg_volDown;
						break;
						case key_plus:
							eve = msg_volUp;
						break;
						case key_left:
							eve = msg_back;
						break;
						case key_right:
							eve = msg_fwd;
						break;
						case key_eq:
							eve = msg_rplay;
						break;
						case key_sp:
							eve = msg_play;
						break;
						case key_100:
							screenON++;
							screenON &= 1;
							i2c_ssd1306_on(screenON);
						break;
						case key_200:
							eve = msg_eqSet;
						break;
						case key_0:
						case key_1:
						case key_2:
						case key_3:
						case key_4:
						case key_5:
						case key_6:
						case key_7:
						case key_8:
						case key_9:
						break;
					}//switch (kid)
					if (eve != msg_none) putMsg(eve);
				}//if (kid != -1)
			}//if (decodeIRED(&results))
		}
		if (tmr_ired) {
			if (check_tmr10(tmr_ired)) {
				tmr_ired = 0;
				resumeIRED();
			}
		}
#endif

		if (restart_flag) break;

    	evt = getMsg();
    	switch ((int)evt) {
    		case msg_kbd:
#if defined(SET_KBD) && defined(SET_OLED_I2C)
    			//kbdCnt++;
    			//kbdCode = kbd_get_touch();
    			sprintf(buf, "KBD: <%c>", (char)kbdCode);
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 3, false);
#endif
#ifdef SET_DFPLAYER
    			evt_t new_evt = msg_none;
    			switch (kbdCode) {
    				case '*':
    					new_evt = msg_play;//msg_chkMode;//msg_play;
    					break;
    				case '0':
    					new_evt = msg_rplay;
    					break;
    				case '#':
    					new_evt = msg_stop;
    					break;
    				//
    				case '9':
    					new_evt = msg_back;
    					break;
    				case '8':
    					new_evt = msg_eqSet;
    					break;
    				case '7':
    					new_evt = msg_fwd;
    					break;
    				//
    				case '6':
    					new_evt = msg_volDown;
    					break;
    				case '5':
    					new_evt = msg_newDir;//msg_volGet;
    					break;
    				case '4':
    					new_evt = msg_volUp;
    					break;
    				//
    				case '3':
    					break;
    				case '2':
    					new_evt = msg_ukDirSel;//msg_eqGet;
    					break;
    				case '1':
    					break;
    			}
    			if (new_evt != msg_none) putMsg(new_evt);
    		break;
    		case msg_newDirSel:
    			mkLineCenter(line_folder, FONT_WIDTH);
    			i2c_ssd1306_text_xy(line_folder, 1, 5, inv_newDir);
    		break;
    		case msg_newDir:
    		{
    			evt_t ev;
    			if (!newDir) {
    				uk_newDir = dfp_folder;
    				if (uk_newDir > 0) {
    					sprintf(line_folder, "Folder: %u", uk_newDir);
    				} else {
    					sprintf(line_folder, "Folder: root");
    				}
    				inv_newDir = true;
    				newDir = true;
    				tmr_newDir = get_tmr(10);
    				ev = msg_newDirSel;
    			} else {
    				DFP_stop();
    				dfp_pause = true;
    				HAL_Delay(50);
    				//
    				dfp_folder = uk_newDir;
    				if (!dfp_folder) {
    					dfp_track = 1;
    				} else {
    					folder_t *fold = all_folder + dfp_folder - 1;
    					dfp_folder_trk = 1;
    					dfp_folder_tracks = fold->tracks;
    				}
    				newDir = false;
    				tmr_newDir = 0;
    				ev = msg_play;
    			}
    			putMsg(ev);
    		}
    		break;
    		case msg_ukDirSel:
    			if (newDir) {
    				tmr_newDir = get_tmr(10);
    				uk_newDir++;
    				inv_newDir = true;
    				if (uk_newDir > dfp_folders) uk_newDir = 0;
    				if (uk_newDir > 0) {
    					sprintf(line_folder, "Folder: %u", uk_newDir);
    				} else {
    					sprintf(line_folder, "Folder: root");
    				}
    				putMsg(msg_newDirSel);
    			}
    		break;
    		case msg_chkMode:
    			if (!(devError & devDFP)) {
    				if (dfp_folder > 0) {
    					DFP_get_tracks(dfp_folder);
    				} else {
    					putMsg(msg_play);
    				}
    			}
    		break;
    		case msg_play:
    			if (!(devError & devDFP)) {
    				putMsg(msg_showFolder);
    				if (dfp_folder > 0) {
    					DFP_play_folder(dfp_folder, dfp_folder_trk, false);
    				} else {
    					DFP_play_root(dfp_track, false);
    				}
    				putMsg(msg_track);
    			}
    		break;
    		case msg_rplay:
    			if (!dfp_pause) {
    				dfp_pause = true;
    				DFP_pause();
    				//
    				sprintf(buf, " Pause ");
    				mkLineCenter(buf, FONT_WIDTH);
    				i2c_ssd1306_text_xy(buf, 1, 8, true);
    				//i2c_ssd1306_shift(8, OLED_CMD_SHIFT_START);
    				//
    			} else {
    				dfp_pause = false;
    				DFP_unpause();
    				//
    				//i2c_ssd1306_shift(8, OLED_CMD_SHIFT_STOP);
    				tmr_get_trk = get_tmr10(_10ms);
    			}
    		break;
    		case msg_stop:
    			DFP_stop();
    			dfp_pause = true;
    			//
    			strcpy(buf, " Stop ");
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 8, true);
    		break;
    		case msg_back:
    			if (dfp_folder > 0) {
    				if (dfp_folder_trk <= 1) {
    					dfp_folder--;
    					if (dfp_folder > 0) {
    						if (!dfp_folder) dfp_folder = dfp_folders;
    						dfp_folder_trk = 1;
    						if (all_folder) {
    							folder_t *fold = all_folder + dfp_folder - 1;
    							dfp_folder_trk = 1;//fold->tracks;
    							dfp_folder_tracks = fold->tracks;
    						}
    					} else  {
    						dfp_folder = 0;
    						dfp_track = 1;
    					}
    					putMsg(msg_play);
    					break;
    				} else dfp_folder_trk--;
    			}/* else if (!dfp_folder) {
    				if (dfp_track <= 1) {
    					if (dfp_folders) {
    						dfp_folder = dfp_folders;
    						dfp_folder_trk = 1;
    						if (all_folder) {
    							folder_t *fold = all_folder + dfp_folder - 1;
    							dfp_folder_trk = 1;
    							dfp_folder_tracks = fold->tracks;
    						}
    					}
    				}
    			}*/
    			DFP_play_previous();
    			putMsg(msg_track);
    		break;
    		case msg_fwd:
    			if (dfp_folder > 0) {
    				if (dfp_folder_trk >= dfp_folder_tracks) {
    					dfp_folder++;
    					if (dfp_folder > dfp_folders) dfp_folder = 0;//1;
    					if (dfp_folder > 0) {
    						dfp_folder_trk = 1;
    						if (all_folder) {
    							folder_t *fold = all_folder + dfp_folder - 1;
    							dfp_folder_tracks = fold->tracks;
    						}
    					} else {
    						dfp_folder = 0;
    						dfp_track = 1;
    					}
    					putMsg(msg_play);
    					break;
    				} else dfp_folder_trk++;
    			}/* else if (!dfp_folder) {
    				//
    				if (dfp_track >= dfp_all_tracks) {
    					if (dfp_folders > 0) {
    						dfp_folder = 1;
    						dfp_folder_trk = 1;
    						if (all_folder) {
    							folder_t *fold = all_folder + dfp_folder - 1;
    							dfp_folder_tracks = fold->tracks;
    						}
    					}
    				}
    				//
    			}*/
    			DFP_play_next();
    			putMsg(msg_track);
    		break;
    		case msg_eqSet:
    			eqClass++;
    			if (eqClass > EQ_Bass) eqClass = EQ_Normal;
    			DFP_set_eq(eqClass);
    			//
    			sprintf(buf, "Eq: %s ", eqName[eqClass]);
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 7, false);
    		break;
    		case msg_eqGet:
    		    DFP_get_eq();
    		break;
    		case msg_volUp:
    			DFP_volumeUP();
    			if (dfp_volume < DFPLAYER_MAX_VOLUME) dfp_volume++;
    			//
    			sprintf(buf, "Volume: %d ", dfp_volume);
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 6, false);
    		break;
    		case msg_volDown:
    			DFP_volumeDOWN();
    			if (dfp_volume > 0) dfp_volume--;
    			//
    			sprintf(buf, "Volume: %d ", dfp_volume);
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 6, false);
    		break;
    		case msg_volGet:
    			DFP_get_volume();
    		break;
    		case msg_track:
    			if (!tmr_get_trk) tmr_get_trk = get_tmr10(_500ms);
    		break;
    		case msg_folders:
    			DFP_get_folders();
    		break;
    		case msg_getAllFolders:
    			if ((curFolder > 0) && (curFolder <= dfp_folders)) {
    				DFP_get_tracks(curFolder);
    			} else {
    				dfp_folder = all_folder->number;
					dfp_folder_tracks = all_folder->tracks;
					dfp_folder_trk = 1;

    				putMsg(msg_tail);
    			}
    		break;
    		case msg_tail:
    			if (!(devError & devDFP)) {
    				DFP_set_storage(idDev);//if (idDev) putMsg(msg_playDev);
    				if (startOne) putMsg(msg_volGet);
    			}
    		break;
    		case msg_showFolder:
    			if (dfp_folder > 0) {
    				sprintf(line_folder, "Folder: %u.%u", dfp_folder, dfp_folder_tracks);
    			} else {
    				sprintf(line_folder, "Folder: root");
    			}
    			mkLineCenter(line_folder, FONT_WIDTH);
    			i2c_ssd1306_text_xy(line_folder, 1, 5, false);
    		break;
    		case msg_getAllTracks:
    			DFP_get_track();
    		break;
    		case msg_dfpRX:
    		{
#ifdef DFP_DUBUG
    			stx[0] = '\0';//memset(stx, 0, sizeof(stx));
    			for (int i = 0; i < dfp_ACK_len; i++) sprintf(stx+strlen(stx), " %02X", *(dfp_ACK + i));
    			Report("msg_dfpRX", true, "%s\n", stx);
#endif
    			cmd_t *ack = (cmd_t *)&dfp_ACK[0];
    			dfpCmd = ack->ccode;
    			bool ys = false;
    			bool inv = false;
    			switch (dfpCmd) {
    				case DFPLAYER_QUERY_SD_FILES:
    					dfp_all_tracks = ack->par2;
    					lnum = 4;
    					//sprintf(buf, "Total trk: %u ", dfp_all_tracks);
    					sprintf(buf, "Storage: %s %u", storageName[idDev], dfp_all_tracks);
    					ys = true;
    					//
    				break;
    				case DFPLAYER_QUERY_STORAGE_DEV:
    					lnum = 4;
    					idDev = ack->par2;
    					if (idDev >= DFPLAYER_MAX_STORAGES) idDev = 0;
    					sprintf(buf, "Storage: %s ", storageName[idDev]);//ack->par2);
    					ys = true;
    					//
    					putMsg(msg_folders);
    					//
    				break;
    				case DFPLAYER_QUERY_FOLDER_FILES:
    					dfp_folder_tracks = ack->par2;
    					sprintf(line_folder, "Folder: %u.%u", curFolder, dfp_folder_tracks);
    					lnum = 5;
    					ys = true;
    					if (all_folder && (dfp_folders > 0)) {
    						folder_t *fold = all_folder + curFolder - 1;
    						fold->number = curFolder;
    						fold->tracks = dfp_folder_tracks;
    						//
#ifdef DFP_DUBUG
    						Report(NULL, true, "Folder %d with %d tracks\n", fold->number, fold->tracks);
#endif
    					}
    					//
    					curFolder++;
    					putMsg(msg_getAllFolders);//msg_play);//msg_track);
					break;
    				case DFPLAYER_QUERY_FOLDERS:
    					dfp_folders = ack->par2;
    					sprintf(line_folder, "Folders: %u ", dfp_folders);
    					lnum = 5;
    					ys = true;
    					//
#ifdef DFP_DUBUG
    					Report(NULL, true, "Total Folders : %d + root\n", dfp_folders);
#endif
    					if (dfp_folders > 0) {
    						if (!all_folder) {
    							all_folder = (folder_t *)calloc(dfp_folders, sizeof(folder_t));
    							if (all_folder) {
    								devError &= ~devMem;
    								putMsg(msg_getAllFolders);
    							} else {
    								devError |= devMem;
    							}
    						}
    					} else {
    						putMsg(msg_tail);
    					}
    				break;
    				case DFPLAYER_QUERY_TRACK_END:
    				case DFPLAYER_QUERY_UTRACK_END:
    					if (!dfp_tmr_next) dfp_tmr_next = get_tmr10(_2s); //putMsg(msg_fwd);//goto play next track
    				break;
    				case DFPLAYER_QUERY_VOLUME:
    					lnum = 6;
    					dfp_volume = ack->par2;
    					sprintf(buf, "Volume: %d ", dfp_volume);
    					ys = true;
    					if (startOne) {
    						putMsg(msg_eqGet);
    						startOne = false;
    					}
    				break;
    				case DFPLAYER_QUERY_EQ:
    					lnum = 7;
    					eqClass = ack->par2;
    					sprintf(buf, "Eq: %s ", eqName[eqClass]);
    					ys = true;
    					putMsg(msg_getAllTracks);
    				break;
    				case DFPLAYER_QUERY_SD_TRACK:
    					lnum = 8;
    					inv = true;
    					dfp_track = ((ack->par1 << 8) | ack->par2);// & 0xfff;
    					if (dfp_folder > 0)
    						sprintf(buf, "Trk: %d.%d.%d ", dfp_folder, dfp_track, dfp_folder_trk);
    					else
    						sprintf(buf, "Trk:  .%d ", dfp_track);
    					ys = true;
    				break;
    				case DFPLAYER_QUERY_ERROR:// Returned data of errors
    				{
    					uint8_t byte = ack->par2;
    					if (byte) devError |= devDFP;// ack->par2 - error code
    					lnum = 8;
    					if (byte >= DFPLAYER_MAX_ERROR) byte = DFPLAYER_MAX_ERROR - 2;
    					sprintf(buf, "ERR: %s ", errName[byte]);
    					ys = true;
    				}
    				break;
    			}
    			if (ys) {
    				char *uki = buf;
    				if (lnum == 5) uki = line_folder;
    				mkLineCenter(uki, FONT_WIDTH);
    				i2c_ssd1306_text_xy(uki, 1, lnum, inv);
    			}
    		}
    		break;
#endif
#ifdef SET_BLE
    		case msg_bleRx:
    			if (strstr(BleBuf, "CONNECTED")) {
    				ble_client.con = 0x81;
    				char *uks = strstr(BleBuf, "Name");
    				if (uks) {//Name:Sabbat X12 Pro
    					memset(ble_client.name, 0, sizeof(ble_client.name));
    					uks += 4;
    					if ((*uks == '=') || (*uks == ':')) uks++;
    					int dl = strlen(uks);
    					char *ukse = strchr(uks, '\n');
    					if (ukse && dl) dl--;//*uke = '\0';
    					if (dl > sizeof(ble_client.name) - 1) dl = sizeof(ble_client.name) - 1;
    					strncpy(ble_client.name, uks, dl);
    					strcpy(ble_str, ble_client.name);
    				}
    			} else if (strstr(BleBuf, "DISCONNECT")) {
    				ble_client.con = 0x80;
    				memset(ble_client.name, 0, sizeof(ble_client.name));
    				strcpy(ble_str, "BLE cli discon.");
    			} else ble_client.con = 0;
    			//
    			if (ble_client.con & 0x80) {// con/discon event !
    				ble_client.con = 0;
    				mkLineCenter(ble_str, FONT_WIDTH);
    				i2c_ssd1306_text_xy(ble_str, 1, 2, false);
    			}
    			//
    			Report(TAG_BLE, true, "%s\n", BleBuf);
    		break;
#endif
    		case msg_sec:
    		{
    			uint32_t cur_sec = get_tmr(0);
#ifdef SET_OLED_I2C
    			sec_to_str_time(cur_sec, buf);
    			i2c_ssd1306_text_xy(mkLineCenter(buf, FONT_WIDTH), 1, 1, true);
    			//
#ifdef SET_BLE
    			if (devError) {
#endif
    				sprintf(buf, "Fifo:%u %u Err:%X", cnt_evt, max_evt, devError);
    				i2c_ssd1306_text_xy(buf, 1, 2, false);
#ifdef SET_BLE
    			}
#endif

#endif
    			if (cur_sec >= (uint32_t)epoch) {
    				if (cur_sec == last_sec)
    					set_Date((time_t)(cur_sec));
    				else
    					last_sec = cur_sec;
    			}

    			if (devError) errLedOn(NULL);
    		}
    		break;
    	}

